# CannotPublishSharedCoordinatesToMirroredNonRevitLinks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..CannotPublishSharedCoordinatesToMirroredNonRevitLinks Property
BuiltInFailures..::..LinkFailures Class See Also
---
Shared coordinates cannot be published to mirrored, non Revit, links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPublishSharedCoordinatesToMirroredNonRevitLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPublishSharedCoordinatesToMirroredNonRevitLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPublishSharedCoordinatesToMirroredNonRevitLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace